In [1]:
import requests
from sodapy import Socrata
import pandas as pd
from sqlalchemy import create_engine
from config import password as pwr

must run: pip install sodapy

In [2]:
#originally did an API Pull before finding a better way
#url="https://data.cityofnewyork.us/resource/3y5p-x48f.json?schoolyear=20152016"
#school_results=requests.get(cases)
#school_results.json()
#school_db=pd.DataFrame(school_results)

In [3]:
#set up Socrata client
client = Socrata("data.cityofnewyork.us", None)

#get results
results = client.get("3y5p-x48f", limit=843113)

# Convert to pandas DataFrame
results_df = pd.DataFrame.from_records(results)

#show reults
results_df

WARNING:root:Requests made without an app_token will be subject to strict throttling limits.

        school        date schoolyear enrolled present absent released
0       01M015  01/04/2016   20152016      168     157     11        0
1       01M015  01/05/2016   20152016      168     153     15        0
2       01M015  01/06/2016   20152016      168     163      5        0
3       01M015  01/07/2016   20152016      168     154     14        0
4       01M015  01/08/2016   20152016      168     158     10        0
...        ...         ...        ...      ...     ...    ...      ...
843108  79X695  11/16/2017   20172018      223     182     41        0
843109  79X695  11/17/2017   20172018      220     177     43        0
843110  79X695  11/20/2017   20172018      216     181     32        3
843111  79X695  11/21/2017   20172018      217     188     29        0
843112  79X695  11/22/2017   20172018      215     187     28        0

[843113 rows x 7 columns]

In [4]:
#check the column types
results_df.dtypes

school        object
date          object
schoolyear    object
enrolled      object
present       object
absent        object
released      object
dtype: object

In [5]:
#delete columns
school_df=results_df[['school','date','schoolyear','enrolled','present','absent']]
school_df

        school        date schoolyear enrolled present absent
0       01M015  01/04/2016   20152016      168     157     11
1       01M015  01/05/2016   20152016      168     153     15
2       01M015  01/06/2016   20152016      168     163      5
3       01M015  01/07/2016   20152016      168     154     14
4       01M015  01/08/2016   20152016      168     158     10
...        ...         ...        ...      ...     ...    ...
843108  79X695  11/16/2017   20172018      223     182     41
843109  79X695  11/17/2017   20172018      220     177     43
843110  79X695  11/20/2017   20172018      216     181     32
843111  79X695  11/21/2017   20172018      217     188     29
843112  79X695  11/22/2017   20172018      215     187     28

[843113 rows x 6 columns]

In [6]:
#convert date to datetime
school_df['date']=pd.to_datetime(school_df['date'])

#convert to integers
school_df['enrolled']=school_df['enrolled'].astype(int)
school_df['present']=school_df['present'].astype(int)
school_df['absent']=school_df['absent'].astype(int)

#rename school to school_id which is the agreed column name that will join the group db together 
school_df.rename(columns={'school':'school_id'},inplace=True)

/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys
/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/pandas/core/frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [7]:
#verify
school_df.head()

  school_id       date schoolyear  enrolled  present  absent
0    01M015 2016-01-04   20152016       168      157      11
1    01M015 2016-01-05   20152016       168      153      15
2    01M015 2016-01-06   20152016       168      163       5
3    01M015 2016-01-07   20152016       168      154      14
4    01M015 2016-01-08   20152016       168      158      10

In [8]:
#organized by school_id and school year
school_attendance_df=school_df.groupby(['school_id']).mean()
school_attendance_df.head()

             enrolled     present     absent
school_id
01M015     176.281955  164.590226  11.546992
01M019     266.744361  242.631579  23.941729
01M020     535.383459  497.968045  37.069549
01M034     358.934211  325.776316  33.033835
01M063     202.065789  187.291353  14.503759

In [9]:
#add percentage column
school_attendance_df['attendance_prc']=round(school_attendance_df['present']/school_attendance_df['enrolled']*100,2)

In [10]:
school_attendance_df.rename(columns={'enrolled':'enrolled_2015_2018','present':'present_2015_2018','absent':'absent_2015_2018'},inplace=True)
school_attendance_df.head()

,enrolled_2015_2018,present_2015_2018,absent_2015_2018,attendance_prc
school_id,,,,
01M015,176.281955,164.590226,11.546992,93.37
01M019,266.744361,242.631579,23.941729,90.96
01M020,535.383459,497.968045,37.069549,93.01
01M034,358.934211,325.776316,33.033835,90.76
01M063,202.065789,187.291353,14.503759,92.69

In [15]:
#create engine
engine = create_engine(f'postgresql://postgres:{pwr}@localhost:5432/project_2')
conn = engine.connect()

In [16]:
#connect database
school_attendance_df.to_sql(name='school_attendance', con=conn, if_exists='append', index=True)

In [17]:
pd.read_sql("select * from school_attendance",conn)

,school_id,enrolled_2015_2018,present_2015_2018,absent_2015_2018,attendance_prc
0,01M015,176,165,12,93.37
1,01M019,267,243,24,90.96
2,01M020,535,498,37,93.01
3,01M034,359,326,33,90.76
4,01M063,202,187,15,92.69
...,...,...,...,...,...
1644,75X754,484,279,190,57.64
1645,75X811,633,524,102,82.83
1646,79M331,11,6,5,53.49
1647,79Q344,423,199,202,46.90
1648,79X695,245,190,44,77.36